landang907-ship-it/xiaozhi/Desktop/ESP32 Wroom/test_oled_project/sdkconfig.defaults
# ============================================================================
# sdkconfig.defaults — Default config cho project test_oled
# ----------------------------------------------------------------------------
# Áp dụng cho ESP32-S3-WROOM-1 (N16R8, 4MB Flash, 2MB Octal PSRAM)
# ============================================================================

# === Target ===
CONFIG_IDF_TARGET="esp32s3"

# === Bootloader / Flash ===
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# === PSRAM (chip N16R8: 2MB Octal PSRAM) ===
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MEMTEST=y

# === FreeRTOS ===
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_SYSTEM_HLWDT_DETECT=y

# === Console / Linenoise (dùng UART0 ra COM port) ===
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# Tắt USB CDC làm console để log ra UART0 (cổng COM)
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE_115200=y

# === USB (tắt CDC để tránh xung đột) ===
# Không bật USB CDC làm console - chỉ dùng UART0
REPLACE

# === Logs ===
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# === I2C ===
CONFIG_I2C_MASTER_INTR_LEVEL_DEFAULT=y

# === Watchdog ===
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT=y
